MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC200LD2AN/mcu.h
/* RTC LIR Bit Field Definitions */
#define RTC_LIR_LIR_Pos         0                                               /*!< RTC_T::LIR: LIR Position */
#define RTC_LIR_LIR_Msk         (1ul << RTC_LIR_LIR_Pos)                        /*!< RTC_T::LIR: LIR Mask */

/* RTC RIER Bit Field Definitions */
#define RTC_RIER_SNOOPIER_Pos   2                                               /*!< RTC_T::RIER: SNOOPIER Position */
#define RTC_RIER_SNOOPIER_Msk   (1ul << RTC_RIER_SNOOPIER_Pos)                  /*!< RTC_T::RIER: SNOOPIER Mask */

#define RTC_RIER_TIER_Pos       1                                               /*!< RTC_T::RIER: TIER Position */
#define RTC_RIER_TIER_Msk       (1ul << RTC_RIER_TIER_Pos)                      /*!< RTC_T::RIER: TIER Mask */

#define RTC_RIER_AIER_Pos       0                                               /*!< RTC_T::RIER: AIER Position */
#define RTC_RIER_AIER_Msk       (1ul << RTC_RIER_AIER_Pos)                      /*!< RTC_T::RIER: AIER Mask */

/* RTC RIIR Bit Field Definitions */
#define RTC_RIIR_SNOOPIF_Pos    2                                               /*!< RTC_T::RIIR: SNOOPIF Position */
#define RTC_RIIR_SNOOPIF_Msk    (1ul << RTC_RIIR_SNOOPIF_Pos)                   /*!< RTC_T::RIIR: SNOOPIF Mask */

#define RTC_RIIR_TIF_Pos        1                                               /*!< RTC_T::RIIR: TIF Position */
#define RTC_RIIR_TIF_Msk        (1ul << RTC_RIIR_TIF_Pos)                       /*!< RTC_T::RIIR: TIF Mask */

#define RTC_RIIR_AIF_Pos        0                                               /*!< RTC_T::RIIR: AIF Position */
#define RTC_RIIR_AIF_Msk        (1ul << RTC_RIIR_AIF_Pos)                       /*!< RTC_T::RIIR: AIF Mask */

/* RTC TTR Bit Field Definitions */
#define RTC_TTR_TTR_Pos         0                                               /*!< RTC_T::TTR: TTR Position */
#define RTC_TTR_TTR_Msk         (0x7ul << RTC_TTR_TTR_Pos)                      /*!< RTC_T::TTR: TTR Mask */

/* RTC SPRCTL Bit Field Definitions */
#define RTC_SPRCTL_SPRRDY_Pos       7                                           /*!< RTC_T::SPRCTL: SPRRDY Position */
#define RTC_SPRCTL_SPRRDY_Msk       (1ul << RTC_SPRCTL_SPRRDY_Pos)              /*!< RTC_T::SPRCTL: SPRRDY Mask */

#define RTC_SPRCTL_SPRCFLG_Pos      5                                           /*!< RTC_T::SPRCTL: SPRCFLG Position */
#define RTC_SPRCTL_SPRCFLG_Msk      (1ul << RTC_SPRCTL_SPRCFLG_Pos)             /*!< RTC_T::SPRCTL: SPRCFLG Mask */

#define RTC_SPRCTL_SNOOPMODE_Pos    3                                           /*!< RTC_T::SPRCTL: SNOOPMODE Position */
#define RTC_SPRCTL_SNOOPMODE_Msk    (1ul << RTC_SPRCTL_SNOOPMODE_Pos)           /*!< RTC_T::SPRCTL: SNOOPMODE Mask */

#define RTC_SPRCTL_SPREN_Pos        2                                           /*!< RTC_T::SPRCTL: SPREN Position */
#define RTC_SPRCTL_SPREN_Msk        (1ul << RTC_SPRCTL_SPREN_Pos)               /*!< RTC_T::SPRCTL: SPREN Mask */

#define RTC_SPRCTL_SNOOPLEVEL_Pos   1                                           /*!< RTC_T::SPRCTL: SNOOPLEVEL Position */
#define RTC_SPRCTL_SNOOPLEVEL_Msk   (1ul << RTC_SPRCTL_SNOOPLEVEL_Pos)          /*!< RTC_T::SPRCTL: SNOOPLEVEL Mask */

#define RTC_SPRCTL_SNOOPEN_Pos      0                                           /*!< RTC_T::SPRCTL: SNOOPEN Position */
#define RTC_SPRCTL_SNOOPEN_Msk      (1ul << RTC_SPRCTL_SNOOPEN_Pos)             /*!< RTC_T::SPRCTL: SNOOPEN Mask */
/*@}*/ /* end of group RTC_CONST */
/*@}*/ /* end of group RTC */




/*---------------------- Smart Card Host Interface Controller -------------------------*/
/**
    @addtogroup SC Smart Card Host Interface Controller (SC)
    Memory Mapped Structure for SC Controller
@{ */


typedef struct
{


    /**
 * @var SC_T::RBR
 * Offset: 0x00  SC Receiving Buffer Register.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |RBR       |Receiving Buffer
 * |        |          |By reading RBR, the SC will return an 8-bit received data.
 * @var SC_T::THR
 * Offset: 0x00  SC Transmit Holding Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |THR       |Transmit Holding Buffer
 * |        |          |By writing data to THR, the SC will send out an 8-bit data.
 * |        |          |Note: If SC_CEN(SC_CTL[0]) is not enabled, THR cannot be programmed.
 * @var SC_T::CTL
 * Offset: 0x04  SC Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SC_CEN    |SC Engine Enable Control
 * |        |          |Set this bit to 1 to enable SC operation.
 * |        |          |If this bit is cleared, SC will force all transition to IDLE state.
 * |[1]     |DIS_RX    |RX Transition Disable Control
 * |        |          |0 = The receiver Enabled.
 * |        |          |1 = The receiver Disabled.
 * |        |          |Note:
 * |        |          |If AUTO_CON_EN (SC_CTL[3])is enabled, these fields must be ignored.
 * |[2]     |DIS_TX    |TX Transition Disable Control
 * |        |          |0 = The transceiver Enabled.
 * |        |          |1 = The transceiver Disabled.
 * |[3]     |AUTO_CON_EN|Auto Convention Enable Control
 * |        |          |0 = Auto-convention Disabled.
 * |        |          |1 = Auto-convention Enabled.
 * |        |          |When hardware receives TS in answer to reset state and the TS is direct convention,
 * |        |          |CON_SEL(SC_CTL[5:4]) will be set to 00 automatically, otherwise if the TS is inverse
 * |        |          |convention, and CON_SEL (SC_CTL[5:4]) will be set to 11.
 * |        |          |If software enables auto convention function, the setting step must be done before Answer to
 * |        |          |Reset state and the first data must be 0x3B or 0x3F.
 * |        |          |After hardware received first data and stored it at buffer, hardware will decided the
 * |        |          |convention and change the CON_SEL (SC_CTL[5:4]) bits automatically.
 * |        |          |If the first data is not 0x3B or 0x3F, hardware will generate an interrupt INT_ACON_ERR (if
 * |        |          |ACON_ERR IE (SC_IER[10]) = 1 to CPU.
 * |[5:4]   |CON_SEL   |Convention Selection
 * |        |          |00 = Direct convention.
 * |        |          |01 = Reserved.
 * |        |          |10 = Reserved.
 * |        |          |11 = Inverse convention.
 * |        |          |Note:
 * |        |          |If AUTO_CON_EN(SC_CTL[3]) enabled, this fields are ignored.
 * |[7:6]   |RX_FTRI_LEV|Rx Buffer Trigger Level
 * |        |          |When the number of bytes in the receiving buffer equals the RX_FTRI_LEV, the RDA_IF will be
 * |        |          |set (if IER [RDA_IEN] is enabled, an interrupt will be generated).
 * |        |          |00 = INTR_RDA Trigger Level with 01 Bytes.
 * |        |          |01 = INTR_RDA Trigger Level with 02 Bytes.
 * |        |          |10 = INTR_RDA Trigger Level with 03 Bytes.
 * |        |          |11 = Reserved.
 * |[12:8]  |BGT       |Block Guard Time (BGT)
 * |        |          |Block guard time means the minimum bit length between the leading edges of two consecutive
 * |        |          |characters between different transfer directions.
 * |        |          |This field indicates the counter for the bit length of block guard time.
 * |        |          |According to ISO7816-3, in T = 0 mode, software must fill 15 (real block guard time = 16.5)
 * |        |          |to this field; in T = 1 mode, software must fill 21 (real block guard time = 22.5) to it.
 * |        |          |Note:
 * |        |          |The real block guard time is BGT + 1.
 * |[14:13] |TMR_SEL   |Timer Selection
 * |        |          |00 = All internal timer function Disabled.
 * |        |          |01 = Internal 24 bit timer Enabled.
 * |        |          |Software can configure it by setting SC_TMR0 [23:0].
 * |        |          |SC_TMR1 and SC_TMR2 will be ignored in this mode.
 * |        |          |10 = internal 24 bit timer and 8 bit internal timer Enabled.
 * |        |          |Software can configure the 24 bit timer by setting SC_TMR0 [23:0] and configure the 8 bit
 * |        |          |timer by setting SC_TMR1[7:0].
 * |        |          |SC_TMR2 will be ignored in this mode.
 * |        |          |11 = Internal 24 bit timer and two 8 bit timers Enabled.
 * |        |          |Software can configure them by setting SC_TMR0 [23:0], SC_TMR1 [7:0] and SC_TMR2 [7:0].
 * |[15]    |SLEN      |Stop Bit Length
 * |        |          |This field indicates the length of stop bit.
 * |        |          |0 = The stop bit length is 2 ETU.
 * |        |          |1= The stop bit length is 1 ETU.
 * |        |          |Note:
 * |        |          |The default stop bit length is 2. SMC and UART adopts SLEN to program the stop bit length
 * |[18:16] |RX_ERETRY |RX Error Retry Count Number
 * |        |          |This field indicates the maximum number of receiver retries that are allowed when parity
 * |        |          |error has occurred
 * |        |          |Note1: The real retry number is RX_ERETRY + 1, so 8 is the maximum retry number.
 * |        |          |Note2: This field cannot be changed when RX_ERETRY_EN enabled.
 * |        |          |The change flow is to disable RX_ETRTRY_EN first and then fill in new retry value.
 * |[19]    |RX_ERETRY_EN|RX Error Retry Enable Control
 * |        |          |This bit enables receiver retry function when parity error has occurred.
 * |        |          |0 = RX error retry function Disabled.
 * |        |          |1 = RX error retry function Enabled.
 * |        |          |Note: Software must fill in the RX_ERETRY value before enabling this bit.
 * |[22:20] |TX_ERETRY |TX Error Retry Count Number
 * |        |          |This field indicates the maximum number of transmitter retries that are allowed when parity
 * |        |          |error has occurred.
 * |        |          |Note1: The real retry number is TX_ERETRY + 1, so 8 is the maximum retry number.
 * |        |          |Note2: This field cannot be changed when TX_ERETRY_EN enabled.
 * |        |          |The change flow is to disable TX_ETRTRY_EN first and then fill in new retry value.
 * |[23]    |TX_ERETRY_EN|TX Error Retry Enable Control
 * |        |          |This bit enables transmitter retry function when parity error has occurred.
 * |        |          |0 = TX error retry function Disabled.
 * |        |          |1 = TX error retry function Enabled.
 * |[25:24] |CD_DEB_SEL|Card Detect De-Bounce Selection
 * |        |          |This field indicates the card detect de-bounce selection.
 * |        |          |00 = De-bounce sample card insert once per 384 (128 * 3) engine clocks and de-bounce sample
 * |        |          |card removal once per 128 engine clocks.
 * |        |          |01 = De-bounce sample card insert once per 192 (64 * 3) engine clocks and de-bounce sample
 * |        |          |card removal once per 64 engine clocks.
 * |        |          |10 = De-bounce sample card insert once per 96 (32 * 3) engine clocks and de-bounce sample
 * |        |          |card removal once per 32 engine clocks.
 * |        |          |11 = De-bounce sample card insert once per 48 (16 * 3) engine clocks and de-bounce sample
 * |        |          |card removal once per 16 engine clocks.
 * |[30]    |SYNC      |SYNC Flag Indicator
 * |        |          |Due to synchronization, software should check this bit before writing a new value to
 * |        |          |RX_ERETRY and TX_ERETRY.
 * |        |          |0 = synchronizing is completion, user can write new data to RX_ERETRY and TX_ERETRY.
 * |        |          |1 = Last value is synchronizing.
 * |        |          |Note: This bit is read only.
 * @var SC_T::ALTCTL
 * Offset: 0x08  SC Alternate Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TX_RST    |TX Software Reset
 * |        |          |When TX_RST is set, all the bytes in the transmit buffer and TX internal state machine will
 * |        |          |be cleared.
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the TX internal state machine and pointers.
 * |        |          |Note:
 * |        |          |This bit will be auto cleared after reset is complete.
 * |[1]     |RX_RST    |Rx Software Reset
 * |        |          |When RX_RST is set, all the bytes in the receiver buffer and Rx internal state machine will
 * |        |          |be cleared.
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the Rx internal state machine and pointers.
 * |        |          |Note:
 * |        |          |This bit will be auto cleared after reset is complete.
 * |[2]     |DACT_EN   |Deactivation Sequence Generator Enable Control
 * |        |          |This bit enables SC controller to initiate the card by deactivation sequence
 * |        |          |0 = No effect.
 * |        |          |1 = Deactivation sequence generator Enabled.
 * |        |          |Note1:
 * |        |          |When the deactivation sequence completed, this bit will be cleared automatically and the
 * |        |          |INIT_IS(SC_ISR[8]) will be set to 1.
 * |        |          |Note2:
 * |        |          |This field will be cleared by TX_RST (SC_ALTCTL[0]) and RX_RST(SC_ALTCTL[1]).
 * |        |          |So don't fill this bit, TX_RST, and RX_RST at the same time.
 * |        |          |Note3:
 * |        |          |If SC_CEN (SC_CTL[0]) is not enabled, this filed cannot be programmed.
 * |[3]     |ACT_EN    |Activation Sequence Generator Enable Control
 * |        |          |This bit enables SC controller to initiate the card by activation sequence
 * |        |          |0 = No effect.
 * |        |          |1 = Activation sequence generator Enabled.
 * |        |          |Note1:
 * |        |          |When the activation sequence completed, this bit will be cleared automatically and the
 * |        |          |INIT_IS(SC_ISR[8]) will be set to 1.
 * |        |          |Note2:
 * |        |          |This field will be cleared by TX_RST(SC_ALTCTL[0]) and RX_RST(SC_ALTCTL[1]), so don't fill
 * |        |          |this bit, TX_RST(SC_ALTCTL[0]), and RX_RST(SC_ALTCTL[1]) at the same time.
 * |        |          |Note3:
 * |        |          |If SC_CEN(SC_CTL[0]) is not enabled, this filed cannot be programmed.
 * |[4]     |WARST_EN  |Warm Reset Sequence Generator Enable Control
 * |        |          |This bit enables SC controller to initiate the card by warm reset sequence
 * |        |          |0 = No effect.
 * |        |          |1 = Warm reset sequence generator Enabled.
 * |        |          |Note1:
 * |        |          |When the warm reset sequence completed, this bit will be cleared automatically and the
 * |        |          |INIT_IS(SC_ISR[8]) will be set to 1.
 * |        |          |Note2:
 * |        |          |This field will be cleared by TX_RST(SC_ALTCTL[0]) and RX_RST(SC_ALTCTL[1]), so don't fill
 * |        |          |this bit, TX_RST, and RX_RST at the same time.
 * |        |          |Note3:
 * |        |          |If SC_CEN(SC_CTL[0]) is not enabled, this filed cannot be programmed.
 * |[5]     |TMR0_SEN  |Internal Timer0 Start Enable Control
 * |        |          |This bit enables Timer 0 to start counting.
 * |        |          |Software can fill 0 to stop it and set 1 to reload and count.
 * |        |          |0 = Stops counting.
 * |        |          |1 = Start counting.
 * |        |          |Note1:
 * |        |          |This field is used for internal 24 bit timer when TMR_SEL (SC_CTL[14:13]) = 01.
 * |        |          |Note2:
 * |        |          |If the operation mode is not in auto-reload mode (SC_TMR0[26] = 0), this bit will be
 * |        |          |auto-cleared by hardware.
 * |        |          |Note3:
 * |        |          |This field will be cleared by TX_RST(SC_ALTCTL[0]) and RX_RST(SC_ALTCTL[1]).
 * |        |          |So don't fill this bit, TX_RST and RX_RST at the same time.
 * |        |          |Note4: If SC_CEN(SC_CTL[0]) is not enabled, this filed cannot be programmed.
 * |[6]     |TMR1_SEN  |Internal Timer1 Start Enable Control
 * |        |          |This bit enables Timer 1 to start counting.
 * |        |          |Software can fill 0 to stop it and set 1 to reload and count.
 * |        |          |0 = Stops counting.
 * |        |          |1 = Start counting.
 * |        |          |Note1:
 * |        |          |This field is used for internal 8 bit timer when TMR_SEL(SC_CTL[14:13]) = 10 or
 * |        |          |TMR_SEL(SC_CTL[14:13]) = 11.
 * |        |          |Don't filled TMR1_SEN when TMR_SEL(SC_CTL[14:13]) = 00 or TMR_SEL(SC_CTL[14:13]) = 01.
 * |        |          |Note2:
 * |        |          |If the operation mode is not in auto-reload mode (SC_TMR1[26] = 0), this bit will be
 * |        |          |auto-cleared by hardware.
 * |        |          |Note3:
 * |        |          |This field will be cleared by TX_RST(SC_ALTCTL[0]) and RX_RST(SC_ALTCTL[1]), so don't fill
 * |        |          |this bit, TX_RST(SC_ALTCTL[0]), and RX_RST(SC_ALTCTL[1]) at the same time.
 * |        |          |Note4:
 * |        |          |If SC_CEN(SC_CTL[0]) is not enabled, this filed cannot be programmed.
 * |[7]     |TMR2_SEN  |Internal Timer2 Start Enable Control
 * |        |          |This bit enables Timer 2 to start counting.
 * |        |          |Software can fill 0 to stop it and set 1 to reload and count.
 * |        |          |0 = Stops counting.
 * |        |          |1 = Start counting.
 * |        |          |Note1:
 * |        |          |This field is used for internal 8 bit timer when TMR_SEL(SC_CTL[14:13]) = 11.
 * |        |          |Don't filled TMR2_SEN when TMR_SEL(SC_CTL[14:13]) = 00 or TMR_SEL(SC_CTL[14:13]) = 01 or
 * |        |          |TMR_SEL(SC_CTL[14:13]) = 10.
 * |        |          |Note2:
 * |        |          |If the operation mode is not in auto-reload mode (SC_TMR2[26] = 0), this bit will be
 * |        |          |auto-cleared by hardware.
 * |        |          |Note3:
 * |        |          |This field will be cleared by TX_RST(SC_ALTCTL[0]) and RX_RST(SC_ALTCTL[1]).
 * |        |          |So don't fill this bit, TX_RST(SC_ALTCTL[0]), and RX_RST(SC_ALTCTL[1]) at the same time.
 * |        |          |Note4:
 * |        |          |If SC_CEN(SC_CTL[0]) is not enabled, this filed cannot be programmed.
 * |[9:8]   |INIT_SEL  |Initial Timing Selection
 * |        |          |This fields indicates the timing of hardware initial state (activation or warm-reset or
 * |        |          |deactivation).
 * |        |          |Unit: SC clock
 * |        |          |Activation: refer to SC Activation Sequence in Figure 5-100.
 * |        |          |Warm-reset: refer to Warm-Reset Sequence in Figure 5-101.
 * |        |          |Deactivation: refer to Deactivation Sequence in Figure 5-102.
 * |[12]    |RX_BGT_EN |Receiver Block Guard Time Function Enable Control
 * |        |          |0 = Receiver block guard time function Disabled.
 * |        |          |1 = Receiver block guard time function Enabled.
 * |[13]    |TMR0_ATV  |Internal Timer0 Active State (Read Only)
 * |        |          |This bit indicates the timer counter status of timer0.
 * |        |          |0 = Timer0 is not active.
 * |        |          |1 = Timer0 is active.
 * |[14]    |TMR1_ATV  |Internal Timer1 Active State (Read Only)
 * |        |          |This bit indicates the timer counter status of timer1.
 * |        |          |0 = Timer1 is not active.
 * |        |          |1 = Timer1 is active.
 * |[15]    |TMR2_ATV  |Internal Timer2 Active State (Read Only)
 * |        |          |This bit indicates the timer counter status of timer2.
 * |        |          |0 = Timer2 is not active.
 * |        |          |1 = Timer2 is active.
 * |[16]    |OUTSEL    |Smartcard Data Pin Output Mode Selection
 * |        |          |Use this bit to select smartcard data pin (SC_DATA) output mode
 * |        |          |0 = Quasi mode.
 * |        |          |1 = Open-drain mode.
 * @var SC_T::EGTR
 * Offset: 0x0C  SC Extend Guard Time Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |EGT       |Extended Guard Time
 * |        |          |This field indicates the extended guard timer value.
 * |        |          |Note:
 * |        |          |The counter is ETU base and the real extended guard time is EGT.
 * @var SC_T::RFTMR
 * Offset: 0x10  SC Receive buffer Time-out Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[8:0]   |RFTM      |SC Receiver Buffer Time-Out (ETU Base)
 * |        |          |The time-out counter resets and starts counting whenever the RX buffer received a new data
 * |        |          |word.
 * |        |          |Once the counter decrease to 1 and no new data is received or CPU does not read data by
 * |        |          |reading SC_RBR buffer, a receiver time-out interrupt INT_RTMR will be generated(if
 * |        |          |RTMR_IE(SC_IER[9]) = 1 ).
 * |        |          |Note1: The counter unit is ETU based and the interval of time-out is RFTM + 0.5
 * |        |          |Note2:
 * |        |          |Fill all 0 to this field indicates to disable this function.
 * @var SC_T::ETUCR
 * Offset: 0x14  SC ETU Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |ETU_RDIV  |ETU Rate Divider
 * |        |          |The field indicates the clock rate divider.
 * |        |          |The real ETU is ETU_RDIV + 1.
 * |        |          |Note:
 * |        |          |Software can configure this field, but this field must be greater than 0x004.
 * |[15]    |COMPEN_EN |Compensation Mode Enable Control
 * |        |          |This bit enables clock compensation function.
 * |        |          |When this bit enabled, hardware will alternate between n clock cycles and n-1 clock cycles,
 * |        |          |where n is the value to be written into the ETU_RDIV .
 * |        |          |0 = Compensation function Disabled.
 * |        |          |1 = Compensation function Enabled.
 * @var SC_T::IER
 * Offset: 0x18  SC Interrupt Enable Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RDA_IE    |Receive Data Reach Interrupt Enable Control
 * |        |          |This field is used for received data reaching trigger level RX_FTRI_LEV (SC_CTL[7:6])
 * |        |          |interrupt enable.
 * |        |          |0 = Receive data reach trigger level interrupt Disabled.
 * |        |          |1 = Receive data reach trigger level interrupt Enabled.
 * |[1]     |TXBE_IE   |Transmit Buffer Empty Interrupt Enable Control
 * |        |          |This field is used for transmit buffer empty interrupt enable.
 * |        |          |0 = Transmit buffer empty interrupt Disabled.
 * |        |          |1 = Transmit buffer empty interrupt Enabled.
 * |[2]     |TERR_IE   |Transfer Error Interrupt Enable Control
